# Data Investigation with Pandas Assignment

## 1.0 Importing our Libraries

In [1]:
# Importing the libraries we will need

# Importing the pandas library
import pandas as pd

# Importing the numpy library
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.

In [3]:
# Let's read the data from the CSV file and create the dataframe to be used
data=pd.read_csv("C:/Users/win/Documents/Python Scripts/Assignment/Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv")
data.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4

## 1.2 Previewing our Dataset

In [4]:
# Let's preview the first 10 rows of our data
data.head(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4
5,NAIROBI WEST,Urban,5,7547,7660,15207,Nairobi,NAIROBI,5
6,NAIROBI WEST,Urban,6,6966,7082,14048,Nairobi,NAIROBI,6
7,NAIROBI WEST,Urban,7,6511,6674,13185,Nairobi,NAIROBI,7
8,NAIROBI WEST,Urban,8,6171,6489,12660,Nairobi,NAIROBI,8
9,NAIROBI WEST,Urban,9,6361,6662,13023,Nairobi,NAIROBI,9

## 1.3 Accessing Information about our Dataset

In [5]:
# We can getting to know more about the dataset by accessing its information
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  object
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [15]:
# Challenge 1
# What was the average age of a person of Kenya?
age=pd.to_numeric(data["Age_years"],errors='coerce')
age.info()
age.mean()

<class 'pandas.core.series.Series'>
RangeIndex: 25420 entries, 0 to 25419
Series name: Age_years
Non-Null Count  Dtype
--------------  -----
24800 non-null  float64
dtypes: float64(1)
memory usage: 198.7 KB

79.0

In [16]:
# Challenge 2
# What was the average female population in Kenya?
data["Female"].mean()

763.8725019669552

In [17]:
# Challenge 3
# What was the average male population in Kenya?
data["Male"].mean()

755.0140833988985

In [18]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
sorted_data=data.sort_values(by="Total", ascending=False)
sorted_data.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
108,NAIROBI EAST,Urban,25,21383,23090,44473,Nairobi,NAIROBI,108
113,NAIROBI EAST,Urban,30,23060,18937,41997,Nairobi,NAIROBI,113
189,NAIROBI NORTH,Urban,25,20175,20637,40812,Nairobi,NAIROBI,189
107,NAIROBI EAST,Urban,24,18028,20785,38813,Nairobi,NAIROBI,107
106,NAIROBI EAST,Urban,23,16882,21301,38183,Nairobi,NAIROBI,106

In [27]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
data.County.nunique()
county_data=data.groupby("County")["Total"].sum()
dense_county=county_data.sort_values(ascending=False)
dense_county.head()

County
Nairobi     3138369
Kiambu      1673785
Kakamega    1660651
Nakuru      1603325
Meru        1591533
Name: Total, dtype: int64

In [30]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
data.District.nunique()
district_data=data.groupby("District")["Total"].sum()
dense_district=district_data.sort_values(ascending=True)
dense_district.head()

District
LAIKIPIA NORTH    32762
GARBATULLA        43118
MARSABIT          46502
SAMBURU EAST      59094
SAMBURU NORTH     59801
Name: Total, dtype: int64

In [33]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
nairobi_data=data[data["County"]=="Nairobi"]
nairobi_data["Total"].mean()

9568.198170731708

In [35]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
lamu_data=data[data["County"]=="Lamu"]
lamu_data["Total"].mean()

619.140243902439

In [43]:
# Challenge 9
# What was the total population of Busia County?
busia_data=data[data["County"]=="Busia"]
busia_data["Total"].sum()

743946

In [62]:
# Challenge 10
# What was the average age of person in Busia County? 
data["Age"]=pd.to_numeric(data["Age_years"],errors='coerce')
avg_busia=busia_data["Age"].mean()
age_39=busia_data[busia_data["Age"]==39]
age_39["Total"].sum()

4914

In [57]:
busia_data["Total_Age"]=busia_data["Total"]*busia_data["Age"]
#pd.DataFrame(busia_data["Total_Age"]=busia_data["Total"]*busia_data["Age"])
busia_data.head

C:\Users\win\AppData\Local\Temp\ipykernel_752\2223063623.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  busia_data["Total_Age"]=busia_data["Total"]*busia_data["Age"]

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID,Age,Total_Age
12546,BUSIA,Urban,0,790,843,1633,Busia,WESTERN,12546,0.0,0.0
12547,BUSIA,Urban,1,679,649,1328,Busia,WESTERN,12547,1.0,1328.0
12548,BUSIA,Urban,2,715,725,1440,Busia,WESTERN,12548,2.0,2880.0
12549,BUSIA,Urban,3,709,699,1408,Busia,WESTERN,12549,3.0,4224.0
12550,BUSIA,Urban,4,675,655,1330,Busia,WESTERN,12550,4.0,5320.0

In [58]:
age_sum=busia_data["Total_Age"].sum()
total_sum=busia_data["Total"].sum()
avg_age=age_sum/total_sum
avg_age

19.968622722616963

In [66]:
busia_data.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID,Age,Total_Age
12546,BUSIA,Urban,0,790,843,1633,Busia,WESTERN,12546,0.0,0.0
12547,BUSIA,Urban,1,679,649,1328,Busia,WESTERN,12547,1.0,1328.0
12548,BUSIA,Urban,2,715,725,1440,Busia,WESTERN,12548,2.0,2880.0
12549,BUSIA,Urban,3,709,699,1408,Busia,WESTERN,12549,3.0,4224.0
12550,BUSIA,Urban,4,675,655,1330,Busia,WESTERN,12550,4.0,5320.0

In [65]:
# Challenge 10
# What was the average age of person in Busia County? 
busia_data.head()
busia_data.describe()

,Male,Female,Total,OBJECTID,Age,Total_Age
count,820.000000,820.000000,820.000000,820.000000,800.000000,800.000000
mean,434.295122,472.956098,907.251220,18982.500000,39.500000,18569.471250
std,763.216469,781.958618,1542.300484,6236.927961,23.106653,22345.746912
min,0.000000,0.000000,0.000000,12546.000000,0.000000,0.000000
25%,41.750000,46.750000,91.500000,12750.750000,19.750000,3021.000000
50%,170.000000,197.000000,370.500000,18982.500000,39.500000,12888.000000
75%,483.000000,574.250000,1073.750000,25214.250000,59.250000,23824.500000
max,5355.000000,5319.000000,10642.000000,25419.000000,79.000000,126400.000000

In [63]:
# Challenge 10
#How many people of this age were in Busia County?
data["Age"]=pd.to_numeric(data["Age_years"],errors='coerce')
avg_busia=busia_data["Age"].mean()
age_39=busia_data[busia_data["Age"]==39]
age_39["Total"].sum()

4914

In [70]:
# Challenge 11
# What was the Total population of Teso South District?
teso=data[data["District"]=="TESO SOUTH"]
teso_data=data[data["District"]=="TESO SOUTH"]["Total"].sum()
teso_data

137924

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
#

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#

In [ ]:
# Challenge 15
# What was the urban population in Kenya?
#